txr-academy/FlashPod/nrf52840code/main.c
#include <hal/nrf_gpio.h>
#include <zephyr/kernel.h>
#include <zephyr/bluetooth/bluetooth.h>
#include <zephyr/bluetooth/conn.h>
#include <zephyr/bluetooth/gatt.h>
#include <zephyr/bluetooth/uuid.h>
#include <zephyr/bluetooth/services/nus.h>
#include <zephyr/random/random.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include "rgb_led.h"
#include "ir_sensor.h"
#include "buzzer.h"
#include <zephyr/drivers/gpio.h>
#include <zephyr/console/console.h>

#define DEVICE_NAME     CONFIG_BT_DEVICE_NAME
#define DEVICE_NAME_LEN (sizeof(DEVICE_NAME) - 1)

/* ── NUS UUIDs ──────────────────────────────────────────── */
#define NUS_RX_UUID_VAL \
    BT_UUID_128_ENCODE(0x6E400002, 0xB5A3, 0xF393, 0xE0A9, 0xE50E24DCCA9E)
#define NUS_TX_UUID_VAL \
    BT_UUID_128_ENCODE(0x6E400003, 0xB5A3, 0xF393, 0xE0A9, 0xE50E24DCCA9E)

static struct bt_uuid_128 nus_rx_uuid = BT_UUID_INIT_128(NUS_RX_UUID_VAL);
static struct bt_uuid_128 nus_tx_uuid = BT_UUID_INIT_128(NUS_TX_UUID_VAL);

/* ── Pod names ──────────────────────────────────────────── */
#define NUM_ESP32_PODS  3
static const char *pod_names[NUM_ESP32_PODS] = {
    "Blazepod2", "Blazepod3", "Blazepod4"
};

/* ── Per-pod state ──────────────────────────────────────── */
typedef struct {
    struct bt_conn                 *conn;
    uint16_t                        rx_handle;
    uint16_t                        tx_ccc_handle;
    bool                            connected;
    bool                            handles_found;
    struct bt_gatt_discover_params  disc_params;
    struct bt_gatt_subscribe_params sub_params;
} pod_t;

static pod_t pods[NUM_ESP32_PODS];

/* ── Thread config ──────────────────────────────────────── */
#define IR_THREAD_STACK_SIZE    2048
#define IR_THREAD_PRIORITY      5
#define IR_POLL_INTERVAL_MS     50
#define GAME_THREAD_STACK_SIZE  2048
#define GAME_THREAD_PRIORITY    6
#define UART_THREAD_STACK_SIZE  2048
#define UART_THREAD_PRIORITY    7
#define BUZZ_THREAD_STACK_SIZE  512
#define BUZZ_THREAD_PRIORITY    8
#define MODE_THREAD_STACK_SIZE  1024
#define MODE_THREAD_PRIORITY    6

K_THREAD_STACK_DEFINE(ir_stack,   IR_THREAD_STACK_SIZE);
K_THREAD_STACK_DEFINE(game_stack, GAME_THREAD_STACK_SIZE);
K_THREAD_STACK_DEFINE(uart_stack, UART_THREAD_STACK_SIZE);
K_THREAD_STACK_DEFINE(buzz_stack, BUZZ_THREAD_STACK_SIZE);
K_THREAD_STACK_DEFINE(mode_stack, MODE_THREAD_STACK_SIZE);

static struct k_thread ir_thread_data;
static struct k_thread game_thread_data;
static struct k_thread uart_thread_data;
static struct k_thread buzz_thread_data;
static struct k_thread mode_thread_data;

/* ── Buzzer message queue ───────────────────────────────── */
typedef enum {
    BEEP_NONE   = 0,
    BEEP_SHORT  = 1,
    BEEP_LONG   = 2,
    BEEP_DOUBLE = 3,
} beep_type_t;

K_MSGQ_DEFINE(buzz_msgq, sizeof(beep_type_t), 4, 1);

static inline void request_beep(beep_type_t type)
{
    k_msgq_put(&buzz_msgq, &type, K_NO_WAIT);
}

/* ── Timeout ────────────────────────────────────────────── */
static uint32_t timeout_ms = 10000U;

/* ── Game mode ──────────────────────────────────────────── */
typedef enum {
    GAME_MODE_1 = 1,
    GAME_MODE_2 = 2,
    GAME_MODE_3 = 3
} game_mode_t;

static game_mode_t current_mode = GAME_MODE_1;

/* ── Mode switch GPIO ───────────────────────────────────── */
#define MODE_BUTTON_NODE DT_ALIAS(mode_switch)
static const struct gpio_dt_spec mode_btn =
    GPIO_DT_SPEC_GET(MODE_BUTTON_NODE, gpios);
static struct gpio_callback button_cb_data;

/* ── Semaphores ─────────────────────────────────────────── */
static K_SEM_DEFINE(adv_sem,        0, 1);
static K_SEM_DEFINE(game_start_sem, 0, 1);
static K_SEM_DEFINE(round_done_sem, 0, 1);
static K_SEM_DEFINE(mode_switch_sem, 0, 1);

/* ── Shared state ───────────────────────────────────────── */
static K_MUTEX_DEFINE(state_mutex);
static bool            game_running   = false;
static bool            led_active     = false;
static int64_t         led_on_time_ms = 0;
static struct bt_conn *phone_conn     = NULL;
static bool            notif_enabled  = false;
static bool            round_ended    = false;
static int             odd_pod_index  = -1;

/* ── Mode 3 (memory) state ──────────────────────────────── */
static int  mode3_sequence[4];      /* order of available[]-style pod ids */
static int  mode3_seq_len     = 0;
static int  mode3_expected_idx = 0; /* index of next pod the user must tap */
static bool mode3_awaiting_tap = false; /* true while waiting for taps */

/* ── Game colour (Mode 1) ───────────────────────────────── */
static uint8_t game_r = 0xFF;
static uint8_t game_g = 0x00;
static uint8_t game_b = 0x00;

/* ── Game colour (Mode 3) — default YELLOW ─────────────── */
static uint8_t game3_r = 0xFF;
static uint8_t game3_g = 0xFF;
static uint8_t game3_b = 0x00;

/* ── Colour tables ──────────────────────────────────────── */
typedef struct {
    uint8_t     r, g, b;
    const char *name;
} colour_t;

static const colour_t colours_m2[] = {
    { 0xFF, 0x00, 0x00, "RED"   },
    { 0x00, 0xFF, 0x00, "GREEN" },
    { 0x00, 0x00, 0xFF, "BLUE"  },
};
#define NUM_COLOURS_M2 ARRAY_SIZE(colours_m2)

/* ── Track which pod we last tried to connect ───────────── */
static int last_connecting_pod = -1;

/* ── Advertisement data ─────────────────────────────────── */
static const struct bt_data ad[] = {
    BT_DATA_BYTES(BT_DATA_FLAGS, (BT_LE_AD_GENERAL | BT_LE_AD_NO_BREDR)),
    BT_DATA(BT_DATA_NAME_COMPLETE, DEVICE_NAME, DEVICE_NAME_LEN),
};
static const struct bt_data sd[] = {
    BT_DATA_BYTES(BT_DATA_UUID128_ALL, BT_UUID_NUS_SRV_VAL),
};

/* ── Forward declarations ───────────────────────────────── */
static void send_to_phone(const char *msg);
static void ir_thread_fn(void *p1, void *p2, void *p3);
static void game_thread_fn(void *p1, void *p2, void *p3);
static void mode_switch_thread_fn(void *p1, void *p2, void *p3);
static void uart_console_thread_fn(void *p1, void *p2, void *p3);
static void buzz_thread_fn(void *p1, void *p2, void *p3);
static void start_scan(void);
static void write_to_pod(int pod_idx, const char *cmd);
static void turn_off_all_pods(void);
static void handle_mode3_tap(int tapped_avail_idx);

/* ══════════════════════════════════════════════════════════
 * Buzzer thread
 * ══════════════════════════════════════════════════════════ */
static void buzz_thread_fn(void *p1, void *p2, void *p3)
{
    ARG_UNUSED(p1); ARG_UNUSED(p2); ARG_UNUSED(p3);

    beep_type_t type;
    while (true) {
        k_msgq_get(&buzz_msgq, &type, K_FOREVER);
        switch (type) {
        case BEEP_SHORT:
            buzzer_beep_short();
            break;
        case BEEP_LONG:
            buzzer_beep_long();
            break;
        case BEEP_DOUBLE:
            buzzer_beep_short();
            k_sleep(K_MSEC(150));
            buzzer_beep_short();
            break;
        default:
            break;
        }
    }
}

/* ══════════════════════════════════════════════════════════
 * Helper — build list of available (connected) pods
 * ══════════════════════════════════════════════════════════ */
static int build_available(int available[4])
{
    int count = 0;
    available[count++] = 0;
    for (int i = 0; i < NUM_ESP32_PODS; i++) {
        if (pods[i].connected && pods[i].handles_found) {
            available[count++] = i + 1;
        }
    }
    return count;
}

/* ══════════════════════════════════════════════════════════
 * Helper — random colour index excluding one value
 * ══════════════════════════════════════════════════════════ */
static int random_m2_colour_excluding(int exclude_idx)
{
    int idx;
    do {
        idx = sys_rand32_get() % NUM_COLOURS_M2;
    } while (idx == exclude_idx);
    return idx;
}

/* ══════════════════════════════════════════════════════════
 * Turn off all pods
 * ══════════════════════════════════════════════════════════ */
static void turn_off_all_pods(void)
{
    rgb_led_off();
    for (int i = 0; i < NUM_ESP32_PODS; i++) {
        write_to_pod(i, "OFF");
        k_sleep(K_MSEC(20));
    }
}

/* ══════════════════════════════════════════════════════════
 * Mode 3 (memory) — judge a single tap against the expected
 * next pod in the sequence. Called with tapped_avail_idx in
 * the same 0..3 encoding used by available[] (0=local pod1,
 * 1/2/3 = pod2/pod3/pod4).
 * ══════════════════════════════════════════════════════════ */
static void handle_mode3_tap(int tapped_avail_idx)
{
    k_mutex_lock(&state_mutex, K_FOREVER);
    bool already      = round_ended;
    int  expected_idx = mode3_expected_idx;
    int  seq_len       = mode3_seq_len;
    int  expected_pod  = (expected_idx < seq_len) ?
                          mode3_sequence[expected_idx] : -1;
    k_mutex_unlock(&state_mutex);

    if (already || expected_pod < 0) return;

    if (tapped_avail_idx == expected_pod) {
        expected_idx++;

        if (expected_idx >= seq_len) {
            /* Full sequence tapped correctly — round won */
            k_mutex_lock(&state_mutex, K_FOREVER);
            round_ended        = true;
            mode3_awaiting_tap = false;
            mode3_expected_idx = expected_idx;
            k_mutex_unlock(&state_mutex);

            printk("M3:CORRECT\n");
            send_to_phone("MEM:CORRECT\n");
            request_beep(BEEP_SHORT);
            k_sem_give(&round_done_sem);
        } else {
            /* Correct so far, still waiting on more taps */
            k_mutex_lock(&state_mutex, K_FOREVER);
            mode3_expected_idx = expected_idx;
            k_mutex_unlock(&state_mutex);

            char msg[16];
            snprintf(msg, sizeof(msg), "MEM:OK:%d\n", expected_idx);
            printk("M3:OK:%d/%d\n", expected_idx, seq_len);
            send_to_phone(msg);
            request_beep(BEEP_SHORT);
        }
    } else {
        /* Wrong pod tapped — round over */
        k_mutex_lock(&state_mutex, K_FOREVER);
        round_ended        = true;
        mode3_awaiting_tap = false;
        k_mutex_unlock(&state_mutex);

        printk("M3:WRONG\n");
        send_to_phone("MEM:WRONG\n");
        request_beep(BEEP_DOUBLE);
        k_sem_give(&round_done_sem);
    }
}

/* ══════════════════════════════════════════════════════════
 * Send to phone via NUS notify
 * ══════════════════════════════════════════════════════════ */
static void send_to_phone(const char *msg)
{
    if (!notif_enabled) return;
    if (!msg || strlen(msg) == 0) return;

