txr-academy/FlashPod/nrf52840code/main.c
        bt_gatt_discover(conn, &pods[idx].disc_params);
        start_scan();

    } else {
        printk("Phone connected\n");
        k_mutex_lock(&state_mutex, K_FOREVER);
        phone_conn = bt_conn_ref(conn);
        k_mutex_unlock(&state_mutex);
    }
}

static void on_disconnected(struct bt_conn *conn, uint8_t reason)
{
    struct bt_conn_info info;
    bt_conn_get_info(conn, &info);

    if (info.role == BT_CONN_ROLE_CENTRAL) {
        for (int i = 0; i < NUM_ESP32_PODS; i++) {
            if (pods[i].conn == conn) {
                printk("Pod%d disconnected\n", i + 2);
                bt_conn_unref(pods[i].conn);
                pods[i].conn          = NULL;
                pods[i].connected     = false;
                pods[i].handles_found = false;
                pods[i].rx_handle     = 0;
                pods[i].tx_ccc_handle = 0;
                start_scan();
                break;
            }
        }
    } else {
        printk("Phone disconnected\n");
        k_mutex_lock(&state_mutex, K_FOREVER);
        if (phone_conn) {
            bt_conn_unref(phone_conn);
            phone_conn    = NULL;
        }
        game_running       = false;
        led_active         = false;
        notif_enabled      = false;
        round_ended        = true;
        mode3_awaiting_tap = false;
        k_mutex_unlock(&state_mutex);
        turn_off_all_pods();
        k_sem_give(&round_done_sem);   /* unblock game_thread immediately
                                         * instead of leaving it waiting
                                         * out a Mode 3 tap timeout */
        k_sem_give(&adv_sem);
    }
}

static struct bt_conn_cb conn_callbacks = {
    .connected    = on_connected,
    .disconnected = on_disconnected,
};

/* ══════════════════════════════════════════════════════════
 * Mode switch button — ISR + worker thread
 *
 * The GPIO callback runs in interrupt context on this platform,
 * where blocking calls (k_mutex_lock, k_sleep, BLE sends, GATT
 * writes) are illegal and will fault the firmware. So the ISR
 * itself only checks the pin and gives an ISR-safe semaphore;
 * a dedicated thread does all the actual (blocking) work.
 * ══════════════════════════════════════════════════════════ */
static void button_pressed(const struct device *dev,
                            struct gpio_callback *cb,
                            uint32_t pins)
{
    ARG_UNUSED(dev);
    ARG_UNUSED(cb);
    ARG_UNUSED(pins);

    if (gpio_pin_get_dt(&mode_btn) != 1) {
        return;
    }

    k_sem_give(&mode_switch_sem);   /* ISR-safe — no blocking here */
}

static void mode_switch_thread_fn(void *p1, void *p2, void *p3)
{
    ARG_UNUSED(p1); ARG_UNUSED(p2); ARG_UNUSED(p3);

    while (true) {
        k_sem_take(&mode_switch_sem, K_FOREVER);

        if (current_mode == GAME_MODE_1) {
            current_mode = GAME_MODE_2;
            printk("MODE 2\n");
            send_to_phone("MODE:2\n");
        } else if (current_mode == GAME_MODE_2) {
            current_mode = GAME_MODE_3;
            printk("MODE 3\n");
            send_to_phone("MODE:3\n");
        } else {
            current_mode = GAME_MODE_1;
            printk("MODE 1\n");
            send_to_phone("MODE:1\n");
        }

        k_mutex_lock(&state_mutex, K_FOREVER);
        bool running = game_running;
        k_mutex_unlock(&state_mutex);

        if (running) {
            turn_off_all_pods();
            k_mutex_lock(&state_mutex, K_FOREVER);
            led_active         = false;
            round_ended        = true;
            mode3_awaiting_tap = false;
            k_mutex_unlock(&state_mutex);
            k_sem_give(&round_done_sem);
            k_sem_give(&game_start_sem);
        }
    }
}

/* ══════════════════════════════════════════════════════════
 * IR thread
 * ══════════════════════════════════════════════════════════ */
static void ir_thread_fn(void *p1, void *p2, void *p3)
{
    ARG_UNUSED(p1); ARG_UNUSED(p2); ARG_UNUSED(p3);

    bool prev_detected = false;

    while (true) {
        k_sleep(K_MSEC(IR_POLL_INTERVAL_MS));

        k_mutex_lock(&state_mutex, K_FOREVER);
        bool    is_active   = led_active;
        int64_t start       = led_on_time_ms;
        bool    waiting_m3  = mode3_awaiting_tap;
        k_mutex_unlock(&state_mutex);

        if (!is_active && !waiting_m3) {
            prev_detected = false;
            continue;
        }

        int64_t elapsed = is_active ? (k_uptime_get() - start) : 0;

        if (is_active && elapsed >= timeout_ms) {
            k_mutex_lock(&state_mutex, K_FOREVER);
            bool        already = round_ended;
            game_mode_t mode    = current_mode;
            k_mutex_unlock(&state_mutex);

            if (!already) {
                rgb_led_off();
                k_mutex_lock(&state_mutex, K_FOREVER);
                led_active = false;
                if (mode == GAME_MODE_1) {
                    round_ended = true;
                }
                k_mutex_unlock(&state_mutex);

                send_to_phone("POD1:TO\n");
                request_beep(BEEP_LONG);

                if (mode == GAME_MODE_1) {
                    k_sem_give(&round_done_sem);
                }
            }
            prev_detected = false;
            continue;
        }

        bool detected = ir_sensor_detected();

        if (!detected || prev_detected) {
            prev_detected = detected;
            continue;
        }
        prev_detected = detected;

        k_mutex_lock(&state_mutex, K_FOREVER);
        bool        already = round_ended;
        game_mode_t mode    = current_mode;
        int         odd_pod = odd_pod_index;
        k_mutex_unlock(&state_mutex);

        if (already) continue;

        if (mode == GAME_MODE_1) {
            rgb_led_off();
            k_mutex_lock(&state_mutex, K_FOREVER);
            led_active  = false;
            round_ended = true;
            k_mutex_unlock(&state_mutex);

            char msg[24];
            snprintf(msg, sizeof(msg), "POD1:RT:%d\n", (int32_t)elapsed);
            send_to_phone(msg);
            printk("%s", msg);
            request_beep(BEEP_SHORT);
            k_sem_give(&round_done_sem);

        } else if (mode == GAME_MODE_2) {
            turn_off_all_pods();
            k_mutex_lock(&state_mutex, K_FOREVER);
            led_active  = false;
            round_ended = true;
            k_mutex_unlock(&state_mutex);

            if (odd_pod == 0) {
                char msg[24];
                snprintf(msg, sizeof(msg),
                         "POD1:RT:%d\n", (int32_t)elapsed);
                send_to_phone(msg);
                printk("%s", msg);
                request_beep(BEEP_SHORT);
            } else {
                send_to_phone("POD1:WRONG\n");
                printk("POD1:WRONG\n");
                request_beep(BEEP_LONG);
            }
            k_sem_give(&round_done_sem);

        } else if (mode == GAME_MODE_3) {
            handle_mode3_tap(0);
        }
    }
}

/* ══════════════════════════════════════════════════════════
 * Game thread
 * ══════════════════════════════════════════════════════════ */
static void game_thread_fn(void *p1, void *p2, void *p3)
{
    ARG_UNUSED(p1); ARG_UNUSED(p2); ARG_UNUSED(p3);

    while (true) {
        k_sem_take(&game_start_sem, K_FOREVER);

