txr-academy/FlashPod/nrf52840code/main.c
        k_mutex_lock(&state_mutex, K_FOREVER);
        bool        running = game_running;
        game_mode_t mode    = current_mode;
        uint32_t    tmo     = timeout_ms;
        k_mutex_unlock(&state_mutex);

        if (!running) continue;

        int available[4];
        int count = build_available(available);

        printk("Mode%d %d pods\n", mode, count);

        if (mode == GAME_MODE_1) {
            k_mutex_lock(&state_mutex, K_FOREVER);
            uint8_t r = game_r, g = game_g, b = game_b;
            k_mutex_unlock(&state_mutex);

            k_mutex_lock(&state_mutex, K_FOREVER);
            round_ended = false;
            k_mutex_unlock(&state_mutex);

            /* Drain any stale semaphore gives from previous rounds */
            while (k_sem_take(&round_done_sem, K_NO_WAIT) == 0) {}

            int pod = available[sys_rand32_get() % count];
            printk("M1:pod=%d\n", pod + 1);

            if (pod == 0) {
                rgb_led_set_all(r, g, b, 0xFF);
                k_mutex_lock(&state_mutex, K_FOREVER);
                led_active     = true;
                led_on_time_ms = k_uptime_get();
                k_mutex_unlock(&state_mutex);
                send_to_phone("POD1:ON\n");
            } else {
                char cmd[16];
                snprintf(cmd, sizeof(cmd), "ON:%02X%02X%02X", r, g, b);
                write_to_pod(pod - 1, cmd);
                k_sleep(K_MSEC(20));
                char notify[20];
                snprintf(notify, sizeof(notify), "POD%d:ON\n", pod + 1);
                send_to_phone(notify);
            }

            int sem_ret = k_sem_take(&round_done_sem, K_MSEC(tmo + 500));

            turn_off_all_pods();
            k_mutex_lock(&state_mutex, K_FOREVER);
            led_active = false;
            round_ended = true;
            k_mutex_unlock(&state_mutex);

            /* If nobody tapped in time, fire the long beep ourselves —
             * don't rely solely on the ESP32 pod's own remote timeout
             * notification, since with short timeouts that message can
             * race the dongle's own deadline over the BLE link and
             * never arrive before we already turn the pod off. */
            if (sem_ret != 0) {
                request_beep(BEEP_LONG);   /* ── FIX: dongle-driven Mode 1 timeout beep ── */
            }

        } else if (mode == GAME_MODE_2) {
            int same_idx = sys_rand32_get() % NUM_COLOURS_M2;
            int odd_idx  = random_m2_colour_excluding(same_idx);
            int odd_pod  = available[sys_rand32_get() % count];

            printk("M2:same=%s odd=%s odd_pod=%d\n",
                   colours_m2[same_idx].name,
                   colours_m2[odd_idx].name,
                   odd_pod + 1);

            k_mutex_lock(&state_mutex, K_FOREVER);
            odd_pod_index = odd_pod;
            round_ended   = false;
            k_mutex_unlock(&state_mutex);

            /* Drain any stale semaphore gives from previous rounds */
            while (k_sem_take(&round_done_sem, K_NO_WAIT) == 0) {}

            printk("M2 set: odd_pod=%d count=%d\n", odd_pod, count);

            int64_t round_start = k_uptime_get();

            for (int i = 0; i < count; i++) {
                int  p      = available[i];
                bool is_odd = (p == odd_pod);

                uint8_t r = is_odd ? colours_m2[odd_idx].r
                                   : colours_m2[same_idx].r;
                uint8_t g = is_odd ? colours_m2[odd_idx].g
                                   : colours_m2[same_idx].g;
                uint8_t b = is_odd ? colours_m2[odd_idx].b
                                   : colours_m2[same_idx].b;

                if (p == 0) {
                    rgb_led_set_all(r, g, b, 0xFF);
                    k_mutex_lock(&state_mutex, K_FOREVER);
                    led_active     = true;
                    led_on_time_ms = round_start;
                    k_mutex_unlock(&state_mutex);
                } else {
                    char cmd[16];
                    snprintf(cmd, sizeof(cmd),
                             "ON:%02X%02X%02X", r, g, b);
                    write_to_pod(p - 1, cmd);
                    k_sleep(K_MSEC(20));
                }
            }

            char notify[20];
            snprintf(notify, sizeof(notify),
                     "ODD:POD%d\n", odd_pod + 1);
            send_to_phone(notify);

            int sem_ret = k_sem_take(&round_done_sem, K_MSEC(tmo));

            turn_off_all_pods();
            k_mutex_lock(&state_mutex, K_FOREVER);
            led_active  = false;
            round_ended = true;
            k_mutex_unlock(&state_mutex);

            if (sem_ret != 0) {
                send_to_phone("ROUND:TO\n");
                request_beep(BEEP_LONG);
            }

        } else if (mode == GAME_MODE_3) {
            k_mutex_lock(&state_mutex, K_FOREVER);
            uint8_t r3 = game3_r, g3 = game3_g, b3 = game3_b;
            k_mutex_unlock(&state_mutex);

            /* Shuffle the available pods into a random display order */
            int seq[4];
            memcpy(seq, available, sizeof(int) * count);
            for (int i = count - 1; i > 0; i--) {
                int j   = sys_rand32_get() % (i + 1);
                int tmp = seq[i];
                seq[i]  = seq[j];
                seq[j]  = tmp;
            }

            k_mutex_lock(&state_mutex, K_FOREVER);
            memcpy(mode3_sequence, seq, sizeof(int) * count);
            mode3_seq_len       = count;
            mode3_expected_idx  = 0;
            mode3_awaiting_tap  = false;
            round_ended         = false;
            k_mutex_unlock(&state_mutex);

            /* Drain any stale semaphore gives from previous rounds */
            while (k_sem_take(&round_done_sem, K_NO_WAIT) == 0) {}

            printk("M3 set: seq_len=%d\n", count);
            printk("M3: order:");
            for (int i = 0; i < count; i++) printk(" pod%d", seq[i] + 1);
            printk("\n");

            send_to_phone("MEM:SHOW\n");

            /* Playback phase — light each pod for 1s with a short gap.
             * Re-checked each iteration so STOP / mode switch can
             * abort mid-sequence instead of running to completion. */
            bool aborted = false;
            for (int i = 0; i < count; i++) {
                k_mutex_lock(&state_mutex, K_FOREVER);
                bool stop_req = !game_running;
                k_mutex_unlock(&state_mutex);
                if (stop_req) { aborted = true; break; }

                int p = seq[i];
                if (p == 0) {
                    rgb_led_set_all(r3, g3, b3, 0xFF);
                } else {
                    char cmd[16];
                    snprintf(cmd, sizeof(cmd),
                             "ON:%02X%02X%02X", r3, g3, b3);
                    write_to_pod(p - 1, cmd);
                }

                k_sleep(K_MSEC(1000));

                if (p == 0) {
                    rgb_led_off();
                } else {
                    write_to_pod(p - 1, "OFF");
                }

                k_sleep(K_MSEC(300));
            }

            if (!aborted) {
                /* Arm every connected ESP32 pod so its IR sensor keeps
                 * being polled even though its LED is now off — without
                 * this, the pods never look at their sensor at all
                 * during the input phase. The local pod doesn't need a
                 * BLE command; ir_thread_fn already watches
                 * mode3_awaiting_tap directly. */
                for (int i = 0; i < NUM_ESP32_PODS; i++) {
                    if (pods[i].connected && pods[i].handles_found) {
                        write_to_pod(i, "ARM");
                        k_sleep(K_MSEC(20));
                    }
                }

