txr-academy/FlashPod/nrf52840code/main.c
    if (ir_sensor_init() != 0) { printk("IR failed\n"); return 0; }

    if (buzzer_init() != 0) { printk("Buzzer failed\n"); return 0; }

    memset(pods, 0, sizeof(pods));
    last_connecting_pod = -1;

    k_thread_create(&ir_thread_data, ir_stack,
                    K_THREAD_STACK_SIZEOF(ir_stack),
                    ir_thread_fn, NULL, NULL, NULL,
                    IR_THREAD_PRIORITY, 0, K_NO_WAIT);
    k_thread_name_set(&ir_thread_data, "ir_pod1");

    k_thread_create(&game_thread_data, game_stack,
                    K_THREAD_STACK_SIZEOF(game_stack),
                    game_thread_fn, NULL, NULL, NULL,
                    GAME_THREAD_PRIORITY, 0, K_NO_WAIT);
    k_thread_name_set(&game_thread_data, "game");

    k_thread_create(&buzz_thread_data, buzz_stack,
                    K_THREAD_STACK_SIZEOF(buzz_stack),
                    buzz_thread_fn, NULL, NULL, NULL,
                    BUZZ_THREAD_PRIORITY, 0, K_NO_WAIT);
    k_thread_name_set(&buzz_thread_data, "buzzer");

    k_thread_create(&mode_thread_data, mode_stack,
                    K_THREAD_STACK_SIZEOF(mode_stack),
                    mode_switch_thread_fn, NULL, NULL, NULL,
                    MODE_THREAD_PRIORITY, 0, K_NO_WAIT);
    k_thread_name_set(&mode_thread_data, "mode_switch");

    console_getline_init();

    bt_conn_cb_register(&conn_callbacks);

    err = bt_nus_cb_register(&nus_listener, NULL);
    if (err) return err;

    err = bt_enable(NULL);
    if (err) return err;

    bt_le_adv_stop();
    bt_le_adv_start(BT_LE_ADV_CONN_FAST_1, ad, ARRAY_SIZE(ad),
                    sd, ARRAY_SIZE(sd));
    printk("Advertising\n");

    start_scan();

    k_thread_create(&uart_thread_data, uart_stack,
                    K_THREAD_STACK_SIZEOF(uart_stack),
                    uart_console_thread_fn, NULL, NULL, NULL,
                    UART_THREAD_PRIORITY, 0, K_NO_WAIT);
    k_thread_name_set(&uart_thread_data, "uart_cmd");

    while (true) {
        k_sem_take(&adv_sem, K_FOREVER);
        bt_le_adv_stop();
        bt_le_adv_start(BT_LE_ADV_CONN_FAST_1, ad, ARRAY_SIZE(ad),
                        sd, ARRAY_SIZE(sd));
        printk("Adv restarted\n");
    }

    return 0;
}